--1)

SELECT 
    Н_ЛЮДИ.ФАМИЛИЯ, 
    Н_СЕССИЯ.ДАТА
FROM 
    Н_ЛЮДИ 
RIGHT JOIN 
    Н_СЕССИЯ
    ON Н_ЛЮДИ.ИД = Н_СЕССИЯ.ЧЛВК_ИД
WHERE 
    Н_ЛЮДИ.ОТЧЕСТВО < 'Сергеевич' 
    AND Н_СЕССИЯ.ИД = 32199 
    AND Н_СЕССИЯ.ИД > 1975;


--2)

SELECT 
    Н_ЛЮДИ.ИМЯ, 
    Н_ВЕДОМОСТИ.ИД, 
    Н_СЕССИЯ.ИД
FROM 
    Н_ЛЮДИ 
JOIN 
    Н_ВЕДОМОСТИ 
    ON Н_ЛЮДИ.ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
JOIN 
    Н_СЕССИЯ 
    ON Н_ЛЮДИ.ИД = Н_СЕССИЯ.ЧЛВК_ИД
WHERE 
    Н_ЛЮДИ.ФАМИЛИЯ < 'Афанасьев' 
    AND Н_ВЕДОМОСТИ.ДАТА > '2010-06-18';


--3)

SELECT COUNT(*) 
FROM (
    SELECT ИМЯ
    FROM Н_ЛЮДИ
    GROUP BY ИМЯ
);

--4)

SELECT Н_ЛЮДИ.ИМЯ, COUNT(*) 
FROM Н_УЧЕНИКИ
JOIN Н_ПЛАНЫ ON Н_УЧЕНИКИ.ПЛАН_ИД = Н_ПЛАНЫ.ИД
JOIN Н_ФОРМЫ_ОБУЧЕНИЯ ON Н_ПЛАНЫ.ФО_ИД = Н_ФОРМЫ_ОБУЧЕНИЯ.ИД
JOIN Н_ОБУЧЕНИЯ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ОБУЧЕНИЯ.ЧЛВК_ИД
JOIN Н_ЛЮДИ ON Н_ОБУЧЕНИЯ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
WHERE Н_ФОРМЫ_ОБУЧЕНИЯ.НАИМЕНОВАНИЕ = 'Очная'
AND Н_ЛЮДИ.ИМЯ IN (
    SELECT Н_ЛЮДИ.ИМЯ
    FROM Н_УЧЕНИКИ 
    JOIN Н_ПЛАНЫ ON Н_УЧЕНИКИ.ПЛАН_ИД = Н_ПЛАНЫ.ИД
    JOIN Н_ФОРМЫ_ОБУЧЕНИЯ ON Н_ПЛАНЫ.ФО_ИД = Н_ФОРМЫ_ОБУЧЕНИЯ.ИД
    JOIN Н_ОБУЧЕНИЯ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ОБУЧЕНИЯ.ЧЛВК_ИД
    JOIN Н_ЛЮДИ ON Н_ОБУЧЕНИЯ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
    WHERE Н_ФОРМЫ_ОБУЧЕНИЯ.НАИМЕНОВАНИЕ = 'Очная'
    GROUP BY Н_ЛЮДИ.ИМЯ
    HAVING COUNT(*) = 50
)
GROUP BY Н_ЛЮДИ.ИМЯ;


--5)

select  УЧЕНИКИ,
        ФИО,
        СРЕДНЯЯ_ОЦЕНКА
from

(
select  Н_УЧЕНИКИ.ИД AS УЧЕНИКИ,
        CONCAT(Н_ЛЮДИ.ФАМИЛИЯ, ' ', Н_ЛЮДИ.ИМЯ, ' ', Н_ЛЮДИ.ОТЧЕСТВО) AS ФИО,
        AVG(ОЦЕНКА::INTEGER) AS СРЕДНЯЯ_ОЦЕНКА,
    Н_УЧЕНИКИ.ГРУППА AS ГРУППА_УЧЕНИКА
from
Н_УЧЕНИКИ
    JOIN Н_ОБУЧЕНИЯ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ОБУЧЕНИЯ.ЧЛВК_ИД
    JOIN Н_ЛЮДИ ON Н_ОБУЧЕНИЯ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
    JOIN Н_ВЕДОМОСТИ ON Н_ЛЮДИ.ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
    AND ОЦЕНКА IN ('5', '4', '3', '2')
GROUP BY Н_УЧЕНИКИ.ИД, Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ИМЯ, Н_ЛЮДИ.ОТЧЕСТВО, Н_УЧЕНИКИ.ГРУППА
HAVING Н_УЧЕНИКИ.ГРУППА = '4100'
)

WHERE СРЕДНЯЯ_ОЦЕНКА >= (

SELECT MIN(ОЦЕНКА::INTEGER)
FROM
Н_УЧЕНИКИ
    JOIN Н_ВЕДОМОСТИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
AND ОЦЕНКА IN ('5', '4', '3', '2')
GROUP BY Н_УЧЕНИКИ.ГРУППА
HAVING Н_УЧЕНИКИ.ГРУППА = '1100'
)
;


--6)

SELECT 
    Н_УЧЕНИКИ.ГРУППА, 
    CONCAT(Н_ЛЮДИ.ФАМИЛИЯ, ' ', Н_ЛЮДИ.ИМЯ, ' ', Н_ЛЮДИ.ОТЧЕСТВО) AS ФИО, 
    П_ПРКОК_ИД,
FROM
    Н_УЧЕНИКИ
JOIN 
    Н_ПЛАНЫ ON Н_УЧЕНИКИ.ПЛАН_ИД = Н_ПЛАНЫ.ИД
JOIN
    Н_ФОРМЫ_ОБУЧЕНИЯ ON Н_ПЛАНЫ.ФО_ИД = Н_ФОРМЫ_ОБУЧЕНИЯ.ИД
JOIN
    Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ ON Н_ПЛАНЫ.НАПС_ИД = Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ.ИД
JOIN
    Н_НАПР_СПЕЦ ON Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ.НС_ИД = Н_НАПР_СПЕЦ.ИД
JOIN 
    Н_ОБУЧЕНИЯ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ОБУЧЕНИЯ.ЧЛВК_ИД
JOIN 
    Н_ЛЮДИ ON Н_ОБУЧЕНИЯ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
WHERE
    Н_УЧЕНИКИ.ПРИЗНАК = 'отчисл' AND
    Н_УЧЕНИКИ.КОНЕЦ < '2012-09-01 00:00:00' AND
    Н_ФОРМЫ_ОБУЧЕНИЯ.НАИМЕНОВАНИЕ IN ('Очная', 'Заочная') AND
    Н_НАПР_СПЕЦ.НАИМЕНОВАНИЕ = 'Программная инженерия'
;


--7)

SELECT Н_ЛЮДИ.ИД, Н_ЛЮДИ.ИМЯ, Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ОТЧЕСТВО
FROM
    Н_УЧЕНИКИ
JOIN  
    Н_ОБУЧЕНИЯ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ОБУЧЕНИЯ.ЧЛВК_ИД
JOIN    
    Н_ЛЮДИ ON Н_ЛЮДИ.ИД = Н_ОБУЧЕНИЯ.ЧЛВК_ИД
JOIN (
    SELECT 
        Н_ЛЮДИ.ИМЯ AS ПОВТ_ИМЯ
    FROM 
        Н_ЛЮДИ
    GROUP BY 
        Н_ЛЮДИ.ИМЯ
    HAVING 
        COUNT(*) > 1
) AS ДУБЛИКАТЫ ON Н_ЛЮДИ.ИМЯ = ДУБЛИКАТЫ.ПОВТ_ИМЯ
;





















